partialSlipStudy/wedgeFstPartialSlip/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices        
(
	//Axis Points
        (0 0 0)
	(0 0 0.005)
	(32 0.02 0)
	(32 0.02 0.005)
	(32 -0.02 0.005)
	(32 -0.02 0)
);

blocks          
(
	hex (0 1 1 0 2 3 4 5) (16 1 128) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (1 4 3 1)
        );
    }
    
    bottom  
    {
        type wall;
        faces
        (
            (0 2 5 0)
        );
    }
    outerWall
    {
        type wall;
        faces
        (
            (3 4 5 2)
        );
    }
    left
    {
        type wedge;
        faces
        (
            (0 1 3 2)
        );
    }
    right
    {
        type wedge;
        faces
        (
            (1 0 5 4)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 0 1 1)
        );
    }
);

mergePatchPairs
(
);
