partialSlipStudy/wedgeFstPartialSlip/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }

    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }

    axis
    {
        type            empty;
    }

    outerWall
    {
        type            zeroGradient;
        value           uniform 0;
    }

    left
    {
        type            wedge;
    }

    right
    {
        type            wedge;
    }
}

// ************************************************************************* //
